In [1]:
import numpy as np

In [3]:
import pandas as pd

In [23]:
one = {'A': ['A1','A2','A3','A4'], 'B': ['B1','B2','B3','B4']}
two = {'C': ['C1','C2','C3','C4'], 'D': ['D1','D2','D3','D4']}

In [24]:
data1 = pd.DataFrame(one)

In [25]:
data1

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [26]:
data2 = pd.DataFrame(two)

In [27]:
data2

    C   D
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

In [28]:
pd.concat([data1, data2], axis=1)

    A   B   C   D
0  A1  B1  C1  D1
1  A2  B2  C2  D2
2  A3  B3  C3  D3
3  A4  B4  C4  D4

In [29]:
pd.concat([data1,data2],axis=0)

     A    B    C    D
0   A1   B1  NaN  NaN
1   A2   B2  NaN  NaN
2   A3   B3  NaN  NaN
3   A4   B4  NaN  NaN
0  NaN  NaN   C1   D1
1  NaN  NaN   C2   D2
2  NaN  NaN   C3   D3
3  NaN  NaN   C4   D4

In [30]:
data2.columns = data1.columns

In [31]:
data2

    A   B
0  C1  D1
1  C2  D2
2  C3  D3
3  C4  D4

In [33]:
new_data = pd.concat([data1,data2],axis=0)

In [38]:
new_data.index = range(len(new_data))

In [39]:
new_data

    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4
4  C1  D1
5  C2  D2
6  C3  D3
7  C4  D4